Autodesk.Revit.DB.Electrical.AnalyticalTransformerData.ApparentPowerRating
The apparent power rating value of the analytical transformer.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for rating is not a number
-or-
When setting this property: The given value for rating is not finite
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for rating must be non-negative.
Since:
2025

Autodesk.Revit.DB.Electrical.AnalyticalTransformerData.SecondaryDistributionSystem
The secondary distribution system of the analytical transformer.
Remarks:
In the case of a transformer, it's crucial that the number of phases in the secondary distribution system matches
that of the primary distribution system. If the number of phases in the secondary system is set to be different from
that of the primary distribution system, it will result in a 'SecondaryNumOfPhasesNotEqualWithPrimary' error.
If you anticipate this discrepancy, you can avoid the error by first setting the secondary distribution system to InvalidElementId,
and then setting the primary distribution system.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The id is neither a distribution system id nor InvalidElementId.
-or-
When setting this property: The secondary distribution system id can't be set to the analytical transformer.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Electrical.AnalyticalTransformerData.Voltage
The voltage value of the analytical transformer.
Since:
2025

Autodesk.Revit.DB.Electrical.AnalyticalTransformerData
Represents the data and parameters of analytical transformer node.
Since:
2025